Тестовая_база_ERP_14/src/InformationRegisters/РЭЙ_ГрафикФинансирования/РЭЙ_ГрафикФинансирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РЭЙ_ГрафикФинансирования</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокТранша</name>
    <type>
      <types>EnumRef.РЭЙ_СрокиПогашенияКредитовВЭД</types>
    </type>
  </resources>
  <resources>
    <name>ОсобоеУсловие</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.РЭЙ_КонтрактыВЭД</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тестовая_база_ERP_14/src/InformationRegisters/РЭЙ_ГрафикФинансирования/ManagerModule.bsl
Функция ПолучитьДанныеДляПечати(КонтрактВЭД) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РЭЙ_ГрафикФинансирования.Договор.ДоговорКонтрагента.ВалютаВзаиморасчетов.Наименование КАК ВалютаНаименование,
	|	РЭЙ_ГрафикФинансирования.Договор.ДоговорКонтрагента.ВалютаВзаиморасчетов.Код КАК ВалютаКод,
	|	РЭЙ_ГрафикФинансирования.Сумма КАК Сумма,
	|	РЭЙ_ГрафикФинансирования.СрокТранша КАК СрокТранша,
	|	РЭЙ_ГрафикФинансирования.Период КАК Дата
	|ИЗ
	|	РегистрСведений.РЭЙ_ГрафикФинансирования КАК РЭЙ_ГрафикФинансирования
	|ГДЕ
	|	РЭЙ_ГрафикФинансирования.Договор = &КонтрактВЭД
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	Запрос.УстановитьПараметр("КонтрактВЭД", КонтрактВЭД);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	Таблица.Колонки.Добавить("НомерСтроки");
	Таблица.Колонки.Добавить("КодСрокаТранша");
	текНомерСтроки = 0;
	Для Каждого СтрокаТЧ Из Таблица Цикл
		текНомерСтроки = текНомерСтроки + 1;
		СтрокаТЧ.НомерСтроки = текНомерСтроки;
		СтрокаТЧ.КодСрокаТранша = Сред(Строка(СтрокаТЧ.СрокТранша), 1, 1);
	КонецЦикла;
	
	Возврат Таблица;
КонецФункции
